<p> Вариант 2
<p> 
<?php
    $N = rand(1,10); // Размер массива

    echo "Изначальный массив: ";
    $a[0] = rand(-10,10);
    echo $a[0];
    for ($c = 1; $c < $N; $c++){
        $a[] = rand(-10,10);
        echo ", ".$a[$c];
    }

    // Распределение чисел по разным массивам
    for ($c = 0; $c < $N; $c++){
        if ($a[$c] < 0){
            $a1[] = $a[$c];
        }
        else if ($a[$c] == 0){
            $a2[] = $a[$c];
        }
        else{
            $a3[] = $a[$c];
        }
    }

    unset($a); // Отчистка массива

    // Загрузка чисел обратно в массив
    for ($c = 0; $c < count($a1); $c++){
        $a[] = $a1[$c];
    }
    for ($c = 0; $c < count($a2); $c++){
        $a[] = $a2[$c];
    }
    for ($c = 0; $c < count($a3); $c++){
        $a[] = $a3[$c];
    }

    echo "<p> Новый массив: ";
    echo $a[0];
    for ($c = 1; $c < $N; $c++){
        $a[] = rand(-10,10);
        echo ", ".$a[$c];
    }
?>